print("************Table****************")
print("************数组*****************")
a={1,2,3,4,"1234",true,nil}
print(a[0])
print(a[1])
print(#a)
b={1,2,nil,3,4}
print(#b)
print("************遍历************")
for i=1,#a do
    print(a[i])
end
print("**********二维数组**************")
a = {{1,2,3},{4,5,6}}
print(a[1][1])
print("*****************二维数组遍历************")
for i=1,#a do
    b = a[i]
    for j =1,#b do
        print(b[j])
    end
end
print("**************自定义索引*****************")
aa = {[0]=0,1,2,3,4,[-1]=-1}
print(aa[0])
print(#aa)